frontend/controllers/SiteController.php

SELECT * FROM `nobreak` WHERE `Estado` != 'BAJA' ORDER BY `idNOBREAK`
---
    public function actionNobreakListar()
    {
        try {
            $nobreaks = Nobreak::find()->where(['!=', 'Estado', 'BAJA'])->orderBy('idNOBREAK ASC')->all();

SELECT * FROM `fuentes_de_poder` WHERE (`ESTADO` != 'BAJA') AND (`ubicacion_detalle` LIKE '%Catálogo%') ORDER BY `ESTADO`, `MARCA`, `MODELO`
---
    public function actionFuentesCatalogoListar()
    {
        try {
            // Obtener solo fuentes de poder de catálogo
            $fuentes = FuentesDePoder::find()
                ->where(['!=', 'ESTADO', 'BAJA'])
                ->andWhere(['like', 'ubicacion_detalle', 'Catálogo'])
                ->orderBy('ESTADO ASC, MARCA ASC, MODELO ASC')
                ->all();

SELECT * FROM `nobreak` WHERE (`Estado` != 'BAJA') AND (`ubicacion_detalle` LIKE '%Catálogo%') ORDER BY `Estado`, `MARCA`, `MODELO`
---
    public function actionNobreakCatalogoListar()
    {
        try {
            // Obtener solo No Break de catálogo
            $nobreaks = Nobreak::find()
                ->where(['!=', 'Estado', 'BAJA'])
                ->andWhere(['like', 'ubicacion_detalle', 'Catálogo'])
                ->orderBy('Estado ASC, MARCA ASC, MODELO ASC')
                ->all();

SELECT * FROM `baterias` WHERE (`ESTADO` != 'BAJA') AND (`ubicacion_detalle` LIKE '%Catálogo%') ORDER BY `ESTADO`, `MARCA`, `MODELO`
---
    public function actionBateriasCatalogoListar()
    {
        try {
            // Obtener solo baterías de catálogo
            $baterias = Bateria::find()
                ->where(['!=', 'ESTADO', 'BAJA'])
                ->andWhere(['like', 'ubicacion_detalle', 'Catálogo'])
                ->orderBy('ESTADO ASC, MARCA ASC, MODELO ASC')
                ->all();