frontend/models/almacenamiento.php

    public static function getEquiposDanados()
    {
        return self::find()->where(['Estado' => 'dañado(Proceso de baja)'])->all();
---
SELECT * FROM `almacenamiento` WHERE `Estado`='dañado(Proceso de baja)'