frontend/models/equipo.php

SELECT * FROM `equipo` WHERE `Estado`='dañado(Proceso de baja)'
---
    public static function getEquiposDanados()
    {
        return self::find()->where(['Estado' => 'dañado(Proceso de baja)'])->all();