frontend/views/site/historial-bajas.php

                            <tbody>
                                <?php
                                try {
                                    $items = Nobreak::find()
                                        ->where(['Estado' => 'BAJA'])
                                        ->all();
---
SELECT * FROM `nobreak` WHERE `Estado`='BAJA'

                            <tbody>
                                <?php
                                try {
                                    $items = \frontend\models\FuentesDePoder::find()
                                        ->where(['ESTADO' => 'BAJA'])
                                        ->all();
---
SELECT * FROM `fuentes_de_poder` WHERE `ESTADO`='BAJA'

                            <tbody>
                                <?php
                                try {
                                    $items = Equipo::find()
                                        ->where(['Estado' => 'BAJA'])
                                        ->all();
---
SELECT * FROM `equipo` WHERE `Estado`='BAJA'

                            <tbody>
                                <?php
                                try {
                                    $items = Impresora::find()
                                        ->where(['Estado' => 'BAJA'])
                                        ->all();
---
SELECT * FROM `impresora` WHERE `Estado`='BAJA'

                            <tbody>
                                <?php
                                try {
                                    $items = Monitor::find()
                                        ->where(['ESTADO' => 'BAJA'])
                                        ->all();
---
SELECT * FROM `monitor` WHERE `ESTADO`='BAJA'

                            <tbody>
                                <?php
                                try {
                                    $items = Bateria::find()
                                        ->where(['ESTADO' => 'BAJA'])
                                        ->all();
---
SELECT * FROM `baterias` WHERE `ESTADO`='BAJA'

                            <tbody>
                                <?php
                                try {
                                    $items = Almacenamiento::find()
                                        ->where(['ESTADO' => 'BAJA'])
                                        ->all();
---
SELECT * FROM `almacenamiento` WHERE `ESTADO`='BAJA'

                            <tbody>
                                <?php
                                try {
                                    $items = Conectividad::find()
                                        ->where(['Estado' => 'BAJA'])
                                        ->all();
---
SELECT * FROM `conectividad` WHERE `Estado`='BAJA'

                            <tbody>
                                <?php
                                try {
                                    $items = Telefonia::find()
                                        ->where(['ESTADO' => 'BAJA'])
                                        ->all();
---
SELECT * FROM `telefonia` WHERE `ESTADO`='BAJA'

                            <tbody>
                                <?php
                                try {
                                    $items = VideoVigilancia::find()
                                        ->where(['ESTADO' => 'BAJA'])
                                        ->all();
---
SELECT * FROM `video_vigilancia` WHERE `ESTADO`='BAJA'